# Коэффициент a
puts "Введите коэффициент a"
a = gets.to_f

# Коэффициент b
puts "Введите коэффициент b"
b = gets.to_f

# Коэффициент c
puts "Введите коэффициент c"
c = gets.to_f

# Дискриминант
d = b**2 - 4 * a * c

# Определение корней
if d > 0
  x_1 = (- 1 * b + Math.sqrt(d))/2 * a
  x_2 = (- 1 * b - Math.sqrt(d))/2 * a
  puts "Дискриминант равен #{d}, корни уравнения #{x_1} и #{x_2}"
elsif d == 0
  x = - b/2 * a
  puts "Дискриминант равен #{d}, корень равен #{x}"
else
  put "Дискриминант равен #{d}, корней нет"
end
